app/views/tractors/_form.html.erb

SELECT "series".* FROM "series"
---
    <%= f.label "Serie" %><br />
    <%= f.collection_select(:serie_id, Serie.all, :id, :name ) %>