app/views/tractors/_form.html.erb

SELECT "statuses".* FROM "statuses"
---
    <%= f.label "Status" %><br />
    <%= f.collection_select(:status_id, Status.all, :id, :stat ) %>

SELECT "locations".* FROM "locations"
---
    <%= f.label "Emplacement" %><br />
    <%= f.collection_select(:location_id, Location.all, :id, :name ) %>