app/controllers/attachements_controller.rb

SELECT `attachements`.* FROM `attachements`
---
  def index
    @search = Attachement.search(params[:q])

SELECT "attachements".* FROM "attachements" WHERE "attachements"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @attachement = Attachement.find(params[:id])

SELECT "attachements".* FROM "attachements" WHERE "attachements"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @attachement = Attachement.find(params[:id])

INSERT INTO `attachements` (`bonus`, `created_at`, `description`, `emplacement`, `fielddate`, `fonction`, `marque`, `modele`, `prix`, `serial`, `stock`, `updated_at`) VALUES (0, '2013-09-20 22:46:29', 'qwe', 'qwe', NULL, 'qwe', 'qwe', 'qwe', 0, NULL, 'qwe', '2013-09-20 22:46:29')
---
  def create
    @attachement = Attachement.new(params[:attachement])

    respond_to do |format|
      if @attachement.save

SELECT "attachements".* FROM "attachements" WHERE "attachements"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "attachements" SET "modele" = 'N-92-312', "prix" = 7500.0, "updated_at" = '2013-06-10 12:02:06.519835' WHERE "attachements"."id" = 43
---
  def update
    @attachement = Attachement.find(params[:id])

    respond_to do |format|
      if @attachement.update_attributes(params[:attachement])