app/controllers/equipements_controller.rb

SELECT "equipements".* FROM "equipements"
---
  def index
     @search = Equipement.search(params[:q])