app/controllers/rental_fleets_controller.rb

SELECT `rental_fleets`.* FROM `rental_fleets`
---
  def index
    @rental_fleets = RentalFleet.all