app/controllers/rental_fleet2s_controller.rb

SELECT `rental_fleet2s`.* FROM `rental_fleet2s`
---
  def index
    @search = RentalFleet2.search(params[:q])