app/controllers/snowblowers_controller.rb

SELECT `snowblowers`.* FROM `snowblowers`
---
  def index
    @search = Snowblower.search(params[:q])