app/controllers/tracteur_neufs_controller.rb

SELECT "tracteur_neufs".* FROM "tracteur_neufs"
---
  def index
     @search = TracteurNeuf.search(params[:q])