app/controllers/tractors_controller.rb

  def index
    @search = Tractor.search(params[:q])
---
SELECT `tractors`.* FROM `tractors`

  def show
    @tractor = Tractor.find(params[:id])
---
SELECT "tractors".* FROM "tractors" WHERE "tractors"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @tractor = Tractor.find(params[:id])
---
SELECT "tractors".* FROM "tractors" WHERE "tractors"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @tractor = Tractor.new(params[:tractor])

    respond_to do |format|
      if @tractor.save
---
INSERT INTO "tractors" ("brand_id", "created_at", "description", "family_id", "fielddate", "hours", "invdate", "invoice", "location_id", "model", "serial", "serie_id", "status_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @tractor = Tractor.find(params[:id])

    respond_to do |format|
      if @tractor.update_attributes(params[:tractor])
---
SELECT "tractors".* FROM "tractors" WHERE "tractors"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "tractors" SET "stock" = '', "updated_at" = '2013-09-06 19:27:06.958793' WHERE "tractors"."id" = 5

  def destroy
    @tractor = Tractor.find(params[:id])
    @tractor.destroy
---
SELECT "tractors".* FROM "tractors" WHERE "tractors"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "tractors" WHERE "tractors"."id" = ?  [["id", 1]]