app/controllers/used_accessories_controller.rb

  def index
    @search = UsedAccessory.search(params[:q])
---
SELECT `used_accessories`.* FROM `used_accessories`