app/controllers/useds_controller.rb

  def index
    @search = Used.search(params[:q])
---
SELECT `useds`.* FROM `useds`