app/controllers/used_others_controller.rb

  def index
    @used_others = UsedOther.all
---
SELECT `used_others`.* FROM `used_others`